package package1;

public class classwork1 {
    public static void main(String[] args) {

       /* Scanner scanner = new Scanner(System.in);
        int result = 0;
        while (true){
            System.out.println("Введите ваше число(для остановки напишити FINAL");
            String input =scanner.nextLine();
            if(input.equals("FINAL")){
                break;
            }
            result = result + Integer.parseInt(input);
        }

        System.out.println(result);*/

        /*2)Заполнить массив на 45 элементов случайными числами
    от -50 до +50. Вывести в консоль сумму всех его элементов.*/
        /*int[] arrayInt3 = new int[ 50];
        Random random = new Random();
        int u = random.nextInt(50);
        System.out.println(u);

        for (int i = -50; i <= arrayInt3.length; i++){
            arrayInt3[i + 1]=random.nextInt(50);
            System.out.print(arrayInt3[i-1] + " ");*/
      /*  3)Заполнить массив на 45 элементов случайными числами
        от -13 до +30. Вывести в консоль все его нечетные числа которые делятся на три.*/

      /*  int[] arrayInt4 = new int[43];
        for (int i = 0; i < arrayInt4.length; i++) {
            arrayInt4[i] = (int) ((Math.random() * 44) + 30);
            System.out.print(arrayInt4[i] + " ");

        }
        for (int i = 0; i < arrayInt4.length; i++)

        if ((arrayInt4[i] % 2 != 0 && (arrayInt4[i] % 3 == 0 )))
        System.out.println(arrayInt4[i]);*/

//        4)Заполнить массив на 20 элементов случайными числами от 0 до 100.
//    Вывести в консоль все значения данного массива.
//    Найти минимальный элемент и вывести его на консоль.

        /*int[] arrayInt5 = new int[20];
        for (int i = 0; i < arrayInt5.length; i++) {
            arrayInt5[i] = (int) ((Math.random() * 101));
            System.out.print(arrayInt5[i] + " ");
        }
       int minValue = arrayInt5[0];
        for (int i = 0; i < arrayInt5.length; i++) {
if (arrayInt5[i]<minValue){
    minValue = arrayInt5[i];}

}
        System.out.println(minValue);*/



/*Необходимо вывести на экран перевернутый прямоугольный треугольник прямым углом сверху в левой части.
    Для вывода использовать условные операторы, циклы.
    Команду System.out.println(); System.out.print(); и можно использовать только с одним символом *.
    Пользователь вводит с клавиатуры число, которое будет считаться основанием треугольника,
    а программа выводит сам треугольник.
    Пример с числом 7:
    *******
    *    *
    *   *
    *  *
    * *
    **
    *
    Необходимо написать программу для вывода вначале заполненного, а потом и пустого треугольника.*/

       /* String[] arrayInt = new String{"Mond", "Tues", "Wensd", "Thue"};

        for (String i = arrayInt; i < arrayInt.length; i++) {
            arrayInt[i] = (int) ((Math.random() * 44) - 13);
        }

        for (int number : arrayInt) {
            System.out.print(number + " ");
        }
        System.out.println("");

        String[] arrayString = {"Mond", "Tues", "Wensd", "Thue"};

        for (String arrayAlo : arrayString){
            System.out.println(arrayAlo);
        }
*/
    }
}




